title: Service Binary in Suspicious Folder - Possibly Ducktail
status: experimental
description: |
	Detect the creation of a service with a service binary located in a suspicious directory.
	In the sample observed, the binary was in the temp directory.
	For an extended check, please see references.
references:
	- https://ren-zxcyq.github.io
	- https://github.com/SigmaHQ/sigma/blob/master/rules/windows/registry/registry_set/registry_set_creation_service_susp_folder.yml
author: ren-zxcyq
date: 2025-03-25
modified: 2025-03-25
tags:
	- attack.defense-evasion
	- attack.t1569.002
logsource:
	category: registry_set
	product: windows
detection:
	selection:
		TargetObject|startswith: 'HKLM\System\CurrentControlSet\Services\'
		TargetObject|endswith: '\ImagePath'
		Details|contains:
			- '\Temp\'
	condition: selection
falsepositives:
	- Unknown
level: medium
